CodeIgniter4-4.3.6/app/Controllers/Login.php

    public function do_login () {
        $UserModel = new userModel();
        $user_email = $this->request->getPost('user_email');
        $user_password = $this->request->getPost('user_password');
       $result = $UserModel->where('user_email',$user_email)->first();
---
SELECT *
FROM `users`
WHERE `user_email` IS NULL
 LIMIT 1